# VA_NAME = ('кеша', 'асистент', 'бот', 'ассистент')
# VA_ALIAS = ('кеша', 'асистент', 'бот')
#
# VA_TBR = ('скажи', 'розкажи', 'покажи', 'поясни', 'відповідь', 'розкажи', 'скільки', 'котра', 'включи', 'відтвори')
#
# VA_CMD_LIST = {
#     'ctime': ('который час', 'который зараз час', 'час', 'время'),
#     'radio': ('включи музику', 'відтвори радіо'),
#     'music': ('включи музику', 'відтвори музику'),
#     'help': ('команды', 'команда', 'помощь', 'помоги', 'помоги мені', 'помоги мені', 'что ти умеешь', 'помощь', 'сделай что-нибудь', 'что ти можешь', 'покажи свои функции')
# }
#
# VA_VER = '1.0.0'


VA_NAME = 'Jarvis'

VA_VER = "3.0"

VA_ALIAS = ('джарвис', 'бот', 'ассистент', 'асистент', 'ангел', 'кеша', 'кеш', 'инокентий', 'иннокентий', 'кишун', 'киш', 'кишаня', 'кешечка', 'кэш', 'кэша')

VA_TBR = ('скажи', 'покажи', 'відповідь', 'вимови', 'розкажи', 'скільки', 'котра', 'яка')

MICROPHONE_INDEX = 0  # ID микрофона (можете просто менять ID пока при запуске не отобразится нужный)

CHROME_PATH = 'C:\Program Files (x86)\Google\Chrome\Application\chrome.exe %s'

OPENAI_TOKEN = "<ТУТ ТОКЕН CHAT-GPT>"

PICOVOICE_TOKEN = "H2JhXpfLdGYG2wMqvc61tipo0uKZQvwkEfA26CAQQe5n1y7zfZGneQ=="

MONGODB_URL = "mongodb+srv://jhewgnva34:MEtqFXoZ9H9xJjYF@cluster0.9ygmg.mongodb.net/"
MONGODB_NAME = "user_database"
MONGODB_COLLECTION = "users"

VA_CMD_LIST = {
    "open_browser": ('відкрий браузер', 'запусти браузер', 'відкрий гугл хром', 'гугл хром', 'ґугл хром'),
    "open_youtube": ('відкрий ютуб', 'ютуб', 'запусти ютуб'),
    "open_google": ('відкрий гугл', 'гугл', 'запусти гугл'),

    "sound_off": ('виключи звук', 'безвучний режим', 'режим без звука', 'режим без звуку', 'відключи звук'),
    "sound_on": ('включи звук', 'режим зі звуком', 'поверну звук', 'дай звук'),

    "thanks": ('дякую', 'молодець', 'респект', 'ти супер', 'чудова работа', 'ти крутий', 'ти великий молодець', 'ти реально крут', 'ти афигенный', 'ти молодець'),

    "stupid": ('ти дурак', 'ти дурна', 'ти дура', 'ти баран', 'ти тупий', 'ти тупа'),

    "gaming_mode_off": ("рабочий режим", "вернись в рабочий режим", "переключись на компьютер", "назад на компьютер", "відключи ігровий режим", "вийди із ігрового режиму", "вернись в комп'ютер", "вихід з ігрового режиму", "робочий стіл", "вернись в ігровий режим", "виключи ігровий режим"),
    "gaming_mode_on": ("включи ігровий режим", "перейди в ігровий режим", "я хочу поиграть", "переключись на телевизор"),
    "help": ("що ти можеш", "що ти вмієш", "що ти умієш", "твої функції", "які твої функції"),
    "music": ('давай музику', 'музыка', "яндекс музыка", "включи музику", "включає музику", "відкрий музику", "послушаем музику", "хочу музику", "врубай музло", "включи что-то послушать", "давай что-то послушаем"),
    "music_off": ('виключи музику', 'вируби музику', 'забери музику', 'відключи музику', 'закрий музику', 'останови музику', 'хватит музыки'),
    "music_save": ('збережи трек', 'мені подобається трек', 'збережи пісню', 'мені подобається песня', 'добав трек в обране', 'добав пісню в обране', 'запам\'ятай мелодію', 'запам\'ятай трек', 'запам\'ятай пісню', 'добав мелодію в обране', 'збережи то що зараз грає', 'добав то що зараз грає в обране', 'лайкни трек', 'лайкни мелодію', 'лайкни пісню'),

    "music_next": ('наступний трек', "наступна мелодія", "наступна пісня", "переключи трек", "переключи музику", "переключи мелодію", "переключи пісню", "следующая музыка"),
    "music_prev": ('попередня музика', 'попередній трек', "попередня мелодия", "попередня песня", "верни трек", "верни мелодію", "верни пісню", "верни прошлый трек", "верни прошлую мелодію", "верни прошлую пісню", "верни прошлую музику", "верни то що играло", "давай предыдущий трек", "переключи музику обратно", "переключи на прошлый трек", "переключи на прошлую мелодію", "переключи на прошлую пісню"),
    "register_new_user": ("зареєструй нового користувача", "реєстрація нового користувача", "зареєструвати нового користувача", "створити нового користувача", "додати нового користувача"),
    "switch_to_headphones": ('переключи на навушники', 'включи навушники', 'перейди на навушники', 'давай звук в навушники', 'давай звук на навушниках', 'переключи звук в навушники', 'переключи звук на наушники',
                             'переключи на кракени', 'включи кракени', 'перейди на кракени', 'давай звук в кракені', 'давай звук на кракени', 'переключи звук в кракени', 'переключи звук на кракени'
                             'дай звук на кракени', 'дай звук в навушниках'),
    "switch_to_dynamics": ('переключи на динамики', 'включи динаміки', 'перейди на динаміки', 'давай звук в динаміки', 'дай звук в динаміки', 'дай звук в динаміках', 'давай звук на динаміки', 'переключи звук в динаміки', 'переключи звук на динаміки',
                           'переключи на колонки', 'включи колонки', 'перейди на колонки', 'давай звук в колонки', 'давай звук на колонки', 'переключи звук в колонки', 'переключи звук на колонки'),

    "off": ("виключись", "завершити роботу", "закрийся", "відключись", "заверши свою работу", "закінчити работу", "закінчуй роботу", "на сьогодні досить", "на сьогодні хватить", "вигрузи себе із пам'яті", "ти мені надоїв", "час спати"),

    # "help": ('список команд', 'команды', 'что ти умеешь', 'твои навыки', 'навыки'),
    # "ctime": ('время', 'текущее время', 'зараз времени', 'который час'),
    # "joke": ('расскажи анекдот', 'рассмеши', 'шутка', 'расскажи шутку', 'пошути', 'развесели')
}